# [HARD] warm-up

### Import packages

In [2]:
import pandas as pd
import numpy as np

### Create a function to split data into training data and testing data
##### When applying machine learning algorithms in a supervised learning scenario we want to have data to learn from and some data we have never seen before to test what we have learnt. 

### We have two tasks: 
- 	Choosing a condition to split the data on (e.g. we 	gonna choose the year 2010)
-  Split the features from the target we want to 	predict

### 1. Open your CO2 notebook (from yesterday) through terminal!
`use commands cd and jupyter notebook`

In [3]:
df=pd.read_csv("ftp://aftp.cmdl.noaa.gov/products/trends/co2/co2_mm_mlo.txt", header = None, skiprows = 72,
               delim_whitespace = True, usecols = [0,1,3,4,5,6], 
               names = ['Year', 'Month', 'Real Average', 'Interpolated Average', 'Season Trend', 'Date'], 
               na_values =  [-1, -99.9])

In [4]:
df['Day']= 15
df.head()

   Year  Month  Real Average  Interpolated Average  Season Trend  Date  Day
0  1958      3        315.71                315.71        314.62   NaN   15
1  1958      4        317.45                317.45        315.29   NaN   15
2  1958      5        317.50                317.50        314.71   NaN   15
3  1958      6        -99.99                317.10        314.85   NaN   15
4  1958      7        315.86                315.86        314.98   NaN   15

In [5]:
df.rename(inplace = True, columns={'Real Average': 'CO2'})

In [8]:
df.head()

   Year  Month     CO2  Interpolated Average  Season Trend  Date  Day
0  1958      3  315.71                315.71        314.62   NaN   15
1  1958      4  317.45                317.45        315.29   NaN   15
2  1958      5  317.50                317.50        314.71   NaN   15
3  1958      6  -99.99                317.10        314.85   NaN   15
4  1958      7  315.86                315.86        314.98   NaN   15

### 2. If not done yesterday, pick the year column, month column, day column and C02 column from the dataframe

In [6]:
df_sub = df[['Year','Month','Day','CO2']]

In [11]:
df_sub.head()

   Year  Month  Day     CO2
0  1958      3   15  315.71
1  1958      4   15  317.45
2  1958      5   15  317.50
3  1958      6   15  -99.99
4  1958      7   15  315.86

### 3. Create the function
 - cond_df is an array of the column you want to condition your split on
 - the idea is to use np.where on the condition column to get the indices on which the full dataset will be split
 - once we have the indices we can use them on the full dataset to make the split. Notice: the indices of the conditioned column and the pandas df are one and the same.
 - X are all the features and Y should be the CO2 column - please split them before executing the function and assign them to X annd Y 
 
`def tr_te_split(X, Y, cond_df, cond):`

`cond_df could be an array of the year column`
							
`use np.where
`

In [12]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 735 entries, 0 to 734
Data columns (total 4 columns):
Year     735 non-null int64
Month    735 non-null int64
Day      735 non-null int64
CO2      735 non-null float64
dtypes: float64(1), int64(3)
memory usage: 23.0 KB

In [7]:
def tr_te_split(X,Y, cond_df,cond):
    bool_ind = np.where(cond_df == cond, True, False)
    return X[bool_ind], Y[bool_ind]

In [8]:
X = df_sub.loc[:, 'Year':'Day']

In [9]:
Y = df_sub.CO2

In [10]:
X, Y = tr_te_split(X,Y, df_sub.Year, 2010)

     Year  Month  Day
622  2010      1   15
623  2010      2   15
624  2010      3   15
625  2010      4   15
626  2010      5   15
627  2010      6   15
628  2010      7   15
629  2010      8   15
630  2010      9   15
631  2010     10   15
632  2010     11   15
633  2010     12   15

### 4. Check the data sets to see if your split worked (can do manually - with your eyes)


### 5. git push it to your branch!


### [optional] 6. Explore the use of the describe(), info() and dtypes on the pandas df before turnnnig it to numpy array

In [24]:
df_sub.describe()

              Year       Month    Day         CO2
count   735.000000  735.000000  735.0  735.000000
mean   1988.292517    6.489796   15.0  350.221388
std      17.696430    3.451429    0.0   52.172571
min    1958.000000    1.000000   15.0  -99.990000
25%    1973.000000    3.500000   15.0  328.555000
50%    1988.000000    6.000000   15.0  351.620000
75%    2004.000000    9.000000   15.0  376.700000
max    2019.000000   12.000000   15.0  414.660000

In [25]:
df_sub.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 735 entries, 0 to 734
Data columns (total 4 columns):
Year     735 non-null int64
Month    735 non-null int64
Day      735 non-null int64
CO2      735 non-null float64
dtypes: float64(1), int64(3)
memory usage: 23.0 KB

In [26]:
df_sub.dtypes

Year       int64
Month      int64
Day        int64
CO2      float64
dtype: object

In [27]:
df_array = np.array(df_sub)

In [29]:
df_array.shape

(735, 4)

In [30]:
df_array[:2]

array([[1958.  ,    3.  ,   15.  ,  315.71],
       [1958.  ,    4.  ,   15.  ,  317.45]])